Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: The gigantic table on the Send page shows pretty much every special key built-in to AHK.
pt_br: A tabela gigante na página sobre Send mostra basicamente todas as teclas especiais nativas do AHK.

source: The percent-space prefix causes a command parameter to be interpreted as an expression.
pt_br: O prefixo porcentagem seguido de espaço faz com que um parâmetro de um comando seja interpretado como uma expressão.

source: The soundcard analysis script can be used to find the correct device numbers.
pt_br: O script de análise de placa de som pode ser usado para encontrar os números de dispositivos corretos.

source: The -RAW suffix can be omitted, but in that case any newly created files will have a byte order mark.
pt_br: O sufixo -RAW pode ser omitido, mas neste caso somente os novos arquivos terão uma marca de ordem de bytes.

source: The body of a control flow statement is the statement or group of statements to which it applies.
pt_br: O corpo de uma instrução de fluxo de controle é a instrução ou grupo de instruções às quais aquele se aplica.

source: The Separate taskbar buttons option disables this by registering each AutoHotkey executable as a host app (IsHostApp).
pt_br: A opção Botões separados na barra de tarefas desabilita isso registrando cada executável do AutoHotkey como um aplicativo hospedeiro (IsHostApp).

source: The length of a string is the number of characters in the sequence, while the position of a character in the string is merely that character's sequential number.
pt_br: O comprimento de uma string é o número de caracteres na sequência, enquanto a posição de um caractere na string é meramente o número sequencial daquele caractere.

source: The Basics
pt_br: Primeiros passos

source: The Blind mode avoids releasing the modifier keys (Alt, Ctrl, Shift, and Win) if they started out in the down position.
pt_br: O modo Cego evita a soltura das teclas modificadoras (Alt, Ctrl, Shift e Win) se elas começaram na posição “pressionada” (down).

source: The Blind mode can be enabled with {Blind}, which gives the script more control by disabling a number of things that are normally done automatically to make things work as expected.
pt_br: O modo cego pode ser habilitado com {Blind}, o que dá ao script mais controle ao desabilitar várias coisas que normalmente acontecem automaticamente, de forma a fazer com que o script funcione da maneira esperada.

source: The Blind mode is not completely supported by SendPlay, especially when dealing with the modifier keys (Ctrl, Alt, Shift, and Win).
pt_br: O modo Cego não é completamente suportado por SendPlay especialmente quando lidando com as teclas modificadoras (Ctrl, Alt, Shift e Win).

source: The Blind mode is used internally when remapping a key.
pt_br: O modo Cego é usado internamente ao se remapear uma tecla.

source: The Raw mode can be either enabled with {Raw}, SendRaw or ControlSendRaw, which causes all subsequent characters, including the special characters ^+!#{}, to be interpreted literally rather than translating {Enter} to Enter, ^c to Ctrl+C, etc.
pt_br: O modo Bruto pode ser habilitado com {Raw}, SendRaw ou ControlSendRaw, que faz com que todos os caracteres subsequentes, incluindo os caracteres especiais ^+!#{}, sejam interpretados literalmente em vez de traduzir {Enter} para Enter, ^c para Ctrl+C, etc.

source: The Raw mode does not affect the interpretation of escape sequences, variable references and expressions.
pt_br: O modo Bruto não afeta a interpretação de sequencias de escape, referências a variáveis e expressões.

source: The Send, SendRaw, SendInput, SendPlay and SendEvent commands send simulated keystrokes and mouse clicks to the active window.
pt_br: Os comandos Send, sendraw, SendInput, SendPlay e SendEvent enviam pressionamentos de tecla simulados e cliques do mouse para a janela ativa.

source: The Text mode can be enabled with {Text}, which is similar to the Raw mode, except that no attempt is made to translate characters (other than `r, `n, `t and `b) to keycodes; instead, the fallback method is used for all of the remaining characters.
pt_br: O modo Texto pode ser habilitado com {Text}, o que é similar ao modo Bruto, exceto que não se tenta traduzir os caracteres (com exceção de `r, `n, `t e `b) para os respectivos códigos de teclas; em vez disso, o método de salvaguarda é usado para todos os demais caracteres.

source: The X (horizontal), Y (vertical), and Z (altitude/depth) axes of the joystick.
pt_br: os eixos X (horizontal), Y (vertical) e Z (altitude/profundidade) do joystick.

source: The above code is perfectly acceptable.
pt_br: O código acima é perfeitamente aceitável.

source: The built-in variable A_ScriptHwnd contains the unique ID (HWND) of the script's main window.
pt_br: A variável nativa A_ScriptHwnd contém o ID único (HWND) da janela principal do script.

source: The buttons of the joystick.
pt_br: Os botões do joystick.

source: The characters {} are used to enclose key names and other options, and to send special characters literally.
pt_br: Os caracteres {} são usados para envolver nomes de teclas e outras opções, bem como para enviar caracteres especiais literalmente.

source: The characters ^+!# represent the modifier keys Ctrl, Shift, Alt and Win.
pt_br: Os caracteres ^+!# representam as teclas modificadoras Ctrl, Shift, Alt e WinWin, respectivamente.

source: The compiler itself (Ahk2Exe) is not needed to run scripts.
pt_br: O compilador em si (Ahk2Exe) não é necessário para rodar scripts.

source: The decimal separator is always a dot, even if the user's regional settings specify a comma.
pt_br: O separador de casas decimais é sempre um ponto, mesmo se as configurações regionais do usuário especificarem a vírgula.

source: The default title depends on how the script was loaded:
pt_br: O título padrão depende de como o script foi carregado:

source: The difference between the two examples is that the hotkey will be triggered when you press Ctrl+J while the hotstring will convert your typed "ftw" into "Free the whales".
pt_br: A diferença entre os dois exemplos é que a hotkey será desencadeada quando você pressionar Ctrl+J, ao passo que a hotstring converterá sua expressão digitada “sab” em “Salve as baleias”.

source: The directory where you installed AutoHotkey, usually C:\Program Files\AutoHotkey.
pt_br: O diretório em que você instalou o AutoHotkey, normalmente C:\Arquivos de Programas\AutoHotkey.

source: The easiest is to place a shortcut to the script in the Startup folder:
pt_br: O mais fácil é colocar um atalho para o script na pasta Inicializar:

source: The file AutoHotkey.exe is all that is needed to launch any .ahk script.
pt_br: O arquivo AutoHotkey.exe é tudo que precisa para executar qualquer script .ahk.

source: The first line:
pt_br: Primeira linha:

source: The following code illustrates how the default title could be determined by the script itself (but the actual title can be retrieved with WinGetTitle):
pt_br: O código a seguir ilustra como o título principal pod ser determinado pelo próprio script (mas o título verdadeiro pode ser obtido com o comando WinGetTitle:

source: The following example subtracts 7 days from the specified time:
pt_br: O exemplo abaixo subtrai 7 dias do horário especificado:

source: The following function can be used for this purpose:
pt_br: A função a seguir pode ser usada para essa finalidade:

source: The following is a last resort and generally should be attempted only in desperation.
pt_br: O que vem agora é um último recurso e geralmente deve ser usado só em caso de desespero.

source: The following modes affect the interpretation of the characters in Keys or the behavior of key-sending commands such as Send, SendInput, SendPlay, SendEvent and ControlSend.
pt_br: Os modos a seguir afetam a interpretação dos caracteres nas Teclas ou o comportamento de comandos que enviam pressionamentos de tecla como Send, SendInput, SendPlay, SendEvent e ControlSend.

source: The following table lists the special keys that can be sent (each key name must be enclosed in braces):
pt_br: A tabela a seguir lista as teclas especiais que podem ser enviadas (cada nome de tecla deve ser envolto em chaves):

source: The fourth button (XButton1) and the fifth button (XButton2) might be assignable if your mouse driver allows their clicks to be seen by the system.
pt_br: O quarto botão (XButton1) e o quinto botão (XButton2) talvez sejam atribuíveis se o driver de seu mouse permitir que seus cliques sejam visíveis pelo sistema.

source: The function assigned to each of the keys listed below can be overridden by modifying the Windows registry.
pt_br: A função atribuída a cada uma das teclas listadas abaixo pode ser sobrescrita modificando-se o registro do Windows.

source: The functions StrGet and StrPut can be used to convert strings between the native encoding and some other specified encoding.
pt_br: As funções StrGet e StrPut podem ser usadas para converter strings entre a codificação nativa e alguma outra codificação especificada.

source: The installer GUI has an option "Add 'Run with UI Access' to context menus".
pt_br: A interface gráfica (GUI) do instalador tem a opção “Add 'Run with UI Access' to context menus”.

source: The instructions above can be translated into the code below:
pt_br: As instruções acima podem ser traduzidas no código abaixo:

source: The key or key combo needs to go on the left of the ::.
pt_br: A tecla ou combinação de teclas deve aparecer à esquerda dos ::.

source: The left and right mouse buttons should be assignable normally (for example, #LButton:: is the Win+LeftButton hotkey).
pt_br: Os botões esquerdo e direito devem ser atribuíveis normalmente (por exemplo, #LButton:: é a hotkey Win+BotãoDireito).

source: The left mouse button when used with Send, but the primary mouse button when used with hotkeys.
pt_br: O botão esquerdo do mouse quando usado com o comando Send, mas é tratado como botão primário do mouse quando usado com hotkeys.

source: The length of the string does not need to be stored as it can be inferred by the position of the null-terminator.
pt_br: O comprimento de uma string não precisa ser armazenado uma vez que ele pode ser inferido pela posição do caractere finalizador.

source: The most common way assigning the value of a function to a variable is like so:
pt_br: O jeito mais comum de atribuir o valor de uma função a uma variável é o seguinte:

source: The mysterious square brackets
pt_br: Os misteriosos colchetes

source: The name of the joystick or its driver.
pt_br: o nome do joystick ou seu driver.

source: The names of the letter and number keys are the same as that single letter or digit.
pt_br: Os nomes das teclas alfabéticas e numéricas são a própria letra ou dígito sozinho.

source: The native encoding depends on the version of AutoHotkey:
pt_br: A codificação nativa depende da versão do AutoHotkey.

source: The number of axes supported by the joystick.
pt_br: o número de eixos suportados pelo joystick.

source: The number of buttons supported by the joystick (not always accurate).
pt_br: o número de botões suportados pelo joystick (nem sempre é uma medida precisa).

source: The parameters of a message are specified using three different patterns:
pt_br: Os parâmetros de uma mensagem são especificados usando-se três diferentes padrões:

source: The point-of-view (hat) control.
pt_br: o controle de ponto de visão (hat switch ou comutador).

source: The preferred method is #IfWinActive.
pt_br: O método preferido é #IfWinActive.

source: The previous value of MyObject[AnyKey] will be stored in RemovedValue.
pt_br: O valor anterior de MeuObjeto[QualquerChave] será armazenado em ValorDeletado.

source: The program may automatically load script code from the following resources, if present in the file:
pt_br: O problema pode automaticamente carregar o código do script a partir dos recursos abaixo, se estiverem presentes no arquivo:

source: The proper use of objects (and in particular, classes) can result in code which is modular and reusable.
pt_br: O uso correto de objetos (e, em particular, classes) pode resultar em código modular e reusável.

source: The rate at which keystrokes are sent is determined by SetKeyDelay.
pt_br: A frequência com que as teclas são enviadas é determinada pelo comando SetKeyDelay.

source: The reader is not assumed to have any prior knowledge of scripting or programming, but should be prepared to learn new terminology.
pt_br: Não se assume que o leitor tenha qualquer conhecimento prévio de confecção de scripts ou programação, mas deve estar preparado para aprender novas terminologias.

source: The right mouse button when used with Send, but the secondary mouse button when used with hotkeys.
pt_br: O botão direito do mouse quando usado com o comando Send, mas é tratado como botão secundário do mouse quando usado com hotkeys.

source: The rudder or 4th axis of the joystick.
pt_br: o leme ou 4º eixo do joystick.

source: The same as above but with the dot notation.
pt_br: O mesmo do exemplo anterior, mas com a notação de ponto.

source: The script should have assigned a starting value, such as x := 0.
pt_br: O script deveria ter atribuído um valor inicial, como x := 0.

source: The script will always exit, even if MyVar is not 5:
pt_br: O script vai terminar de qualquer jeito, mesmo se MinhaVariavel não é igual a 5:

source: The script's main window is usually hidden, but can be shown via the tray icon or one of the commands listed below to gain access to information useful for debugging the script.
pt_br: A janela principal do script é normalmente oculta, mas pode ser exibida por meio do ícone da bandeja ou um dos comandos listados abaixo para obter-se acesso a informações úteis para depurar o script.

source: The script's own windows can't be automated by non-UIA programs/scripts for security reasons.
pt_br: As janelas do próprio script não podem ser automatizadas por programas/scripts que não sejam UIA por motivos de segurança.

source: The second line:
pt_br: Segunda linha:

source: The sequence of keys to send.
pt_br: A sequência de teclas a enviar.

source: The shortcut to the script should now be in the Startup folder.
pt_br: O atalho para o script deverá agora estar na pasta Inicializar.

source: The simplest way to remove a value is to just blank it out.
pt_br: O jeito mais simples de remover um valor é simplesmente substitui-lo por “nada”.

source: The smallest element in a UTF-16 string is two bytes (16 bits).
pt_br: O menor elemento em uma string em UTF-16 possui dois bytes (16 bits).

source: The smallest element of an ANSI string is one byte.
pt_br: O menor elemento de uma string ANSI é um byte.

source: The third line:
pt_br: Terceira linha:

source: The title of the script's main window is used by the #SingleInstance and Reload mechanisms to identify other instances of the same script.
pt_br: O título da janela principal do script é usado pelos mecanismos #SingleInstance e Reload para identificar outras instâncias do mesmo script.

source: The tray icon usually looks like this (but the color or letter changes when the script is paused or suspended):
pt_br: O ícone da bandeja normalmente é este (mas a cor e as letras mudam conforme o script é pausado ou suspenso):

source: The value it gives will be the number of keys that were removed, which is useful if you have a gap between your keys (e.g. you specify keys 1 through four, but key number 2 doesn't exist, this will set NumberOfRemovedKeys to 3 as only three keys were there to be removed).
pt_br: O valor que o método dará será o número de chaves que foram removidas, o que é útil se você tem uma lacuna entre suas chaves (por exemplo, você especificou as chaves 1 a 4, mas a chave número 2 não existe, isso definirá NumeroDeChavesDeletadas para 3 já que somente três chaves estavam lá para ser removidas.

source: The variable itself.
pt_br: A variável em si.

source: The variable names are known as "Keys", and the contents of the variables are "Values".
pt_br: Os nomes das variáveis são chamados “Chaves” (Keys), e o conteúdo das variáveis, “Valores” (values).

source: The variable's name.
pt_br: Seu nome.

source: The variable's value.
pt_br: O valor da variável.

source: The words true and false are built-in variables containing 1 and 0.
pt_br: As palavras true e false são variáveis nativas contendo 1 e 0.

source: Then try running it again.
pt_br: Então tente executá-lo de novo.

source: Then try to fix your code.
pt_br: Daí tente arrumar seu código.

source: Then, study the code.
pt_br: Em seguida, estude o código.

source: There are a couple of common ways to create a script file:
pt_br: Há alguns jeitos comuns de se criar um arquivo de script:

source: There are a few ways to create an object, and the most common ones are listed below:
pt_br: Há alguns jeitos de se criar um objeto, e os mais comuns são os listados abaixo:

source: There are a few ways to do this, I'll assume you have it installed to the default locations:
pt_br: Há alguns jeitos de fazer isso; vou assumir que instalou o programa no local padrão:

source: There are a number of reasons you might want to use an object for something.
pt_br: Há várias razões para você querer usar um objeto para algo.

source: There are also known issues with DirectX.
pt_br: Há também alguns problemas conhecidos com o DirectX.

source: There are also user-created solutions such as OnWin.ahk and [How to] Hook on to Shell to receive its messages.
pt_br: Também há algumas soluções criadas por usuários como OnWin.ahk e [Como] Enganchar no Shell para receber suas mensagens.

source: There are generally two ways of viewing objects:
pt_br: Há normalmente duas maneiras de visualizar objetos:

source: There are generally two ways to do this while specifying the precision, and both are shown below:
pt_br: Há geralmente dois modos de fazer isso enquanto se especifica a precisão, e ambos são mostrados abaixo:

source: There are many different encodings, but as all of those supported by AutoHotkey include ASCII as a subset, character codes 0 to 127 always have the same meaning.
pt_br: Há várias diferentes codificações, mas todas as que são suportadas pelo AutoHotkey incluem a ASCII como um subconjunto; caracteres de códigos 0 a 127 sempre têm o mesmo significado.

source: There are many variations of this problem, such as:
pt_br: Há algumas variações desse problema, tais como:

source: There are many ways to use objects, including retrieving values, setting values, adding more values, and more.
pt_br: Há várias formas de se usar objetos, inclusive obter valores armazenados, definir valores, adicionar mais valores e mais.

source: There are no keys higher than it to be affected.
pt_br: Não há chaves maiores que ela para serem afetadas.

source: There are no restrictions to what a key or value can be, and they can even be other arrays!
pt_br: Não há restrições quanto a o que uma chave ou valor podem ser, e eles podem inclusive ser outros vetores!

source: There are several ways of doing this, but the simplest way is InputBox.
pt_br: Há vários jeitos de fazer isso, mas o mais simples é por meio do comando InputBox.

source: There are several ways to make a script (or any program) launch automatically every time you start your PC.
pt_br: Existem vários jeitos de fazer com que um script (ou qualquer programa) inicie automaticamente toda vez que você iniciar seu PC.

source: There are some cases where empty values are assumed to be 0, but it is best not to rely on this.
pt_br: Há alguns casos em que valores vazios são considerados iguais a 0, mas é melhor não pressupor isso.

source: There are some other advanced features as well, such as command line parameters and CLSID.
pt_br: Há outras funcionalidades avançadas, como parâmetros da linha de comando e CLSID.

source: There is no single solution to make AutoHotkey work in all programs.
pt_br: Não existe uma solução única para fazer o AutoHotkey funcionar em todos os programas.

source: These can be used as hotkeys with some (but not all) mice which have a second wheel or support tilting the wheel to either side.
pt_br: Estes botões podem ser usados como hotkeys com alguns (mas não todos) mouses que tenham uma segunda roda ou tenham suporte à inclinação da roda para qualquer dos lados.

source: These modes must be specified as {x} in Keys, where x is either Raw, Text, or Blind.
pt_br: Esses modos são especificados commo {x} em “Teclas”, onde x é Raw, Text ou Blind.

source: These settings are permanent; this is, they apply for all current and future visits to this help.
pt_br: Estas configurações são permanentes; isto é, elas se aplicam à presente e às futuras visitas a esta ajuda.

source: These special commands (technically called "directives") create context-sensitive hotkeys and hotstrings.
pt_br: Esses comandos especiais (tecnicamente chamados de “diretivas”) criam hotkeys e hotstrings sensíveis ao contexto.

source: They affect only the very next key.
pt_br: Isso afeta somente a tecla que vier logo depois.

source: They are also mutually exclusive; that is, only the most recent one will be in effect.
pt_br: Elas também são mutuamente excludentes; isto é, somente a mais recente terá efeito.

source: They are most often used with functions and control flow statements such as If and Loop.
pt_br: Eles são mais usados com funções e instruções de fluxo de controle, como If e Loop.

source: They can be used to make a script more readable.
pt_br: Elas podem ser usadas para tornar um script mais legível.

source: They can be used to store text, numbers, data from functions and commands or even mathematical equations.
pt_br: Elas podem ser usadas para armazenar texto, números, dados vindos de funções e comandos e até mesmo equações matemáticas.

source: They group a section of code together so that AutoHotkey knows it's one big family and that it needs to stay together.
pt_br: Elas agrupam uma seção do código de forma que o AutoHotkey saberá que se trata de uma única grande família e que precisa ficar junta.

source: Things like GameGuard, Hackshield, PunkBuster and several others.
pt_br: São soluções como o GameGuard, Hackshield, PunkBuster e diversos outros.

source: This "appends" the values to the end of the array MyObject.
pt_br: Este método acrescenta os valores ao final do vetor MeuObjeto.

source: This example script makes 000 into an equals key.
pt_br: Este script de exemplo transforma a tecla 000 uma tecla de “igual”.

source: This allows subroutines launched by new threads (such as for hotkeys, menus, timers and such) to change settings without affecting other threads.
pt_br: Isso permite que sub-rotinas sejam executadas por novos fios de execução (como hotkeys, menus, timers e afins) para alterar configurações sem afetar outros fios de execução.

source: This allows the function to modify the object, but it does not allow the function to modify the variable which the function's caller used, because the function only has a reference to the object, not the variable.
pt_br: Isso permite que a função modifique o objeto, mas não permite que a função modifique a variável que o chamador da função empregou, pois a função apenas tem uma referência ao objeto, não à variável.

source: This allows you to use an expression as the key to get the value from your object.
pt_br: Esta notação permite que você use uma expressão como a chave para obter um valor de seu objeto.

source: This ambiguity causes unexpected behavior in at least two cases:
pt_br: Essa ambiguidade causa comportamentos inesperados em pelo menos dois casos:

source: This and the next methods below remove the key and the value.
pt_br: Este método e o próximo abaixo removem a chave e o valor.
